
Процедура ПриОткрытии()
	ИмяКонф			= СокрЛП(ПараметрЗапуска);
	
	ФормаЗапускаПроверки = ПолучитьФорму("Обработка.ЗапускПроверки.Форма");
	ФормаЗапускаПроверки.ФлагПроверкаПоРасписанию = Истина;
	ФормаЗапускаПроверки.Конфигурация = Справочники.Конфигурации.НайтиПоНаименованию(ИмяКонф);
	ФормаЗапускаПроверки.Открыть();
	
	ФлагУспешно = ФормаЗапускаПроверки.ВыполнитьПроверку();
	ФормаЗапускаПроверки.Закрыть();
	Если ФлагУспешно Тогда
		ЗавершитьРаботуСистемы(Ложь,,0);
	Иначе
		ЗавершитьРаботуСистемы(Ложь,,1);
	КонецЕсли;
КонецПроцедуры


