
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
КонецПроцедуры

Процедура ПриОткрытии()
	Если ЗначениеЗаполнено(ПараметрЗапуска) Тогда
		ПараметрыЗапуска=РазложитьСтрокуВМассивПодстрок(ПараметрЗапуска,"|");
		EPF				= ПараметрыЗапуска[0];
		Синоним			= ПараметрыЗапуска[1];
		ПутьДляОтчетов	= ПараметрыЗапуска[2];
		
		ВнОбработка=ВнешниеОбработки.Создать(EPF+".epf");
		ВерсияНомер="";
		Конфигурация = Справочники.Конфигурации.НайтиПоНаименованию(Синоним).Ссылка;
		Версия=Справочники.Версии.НайтиПоНаименованию(ВерсияНомер,,,Конфигурация);
		ВнОбработка=Неопределено;
		
		Отчет=Отчеты.НайденныеОшибки.Создать();
		ПараметрыНастроек = Новый Соответствие;
		Сообщить(Версия);
		ПараметрыНастроек.Вставить("Версия", Версия);
		Сообщить(Конфигурация);
		ПараметрыНастроек.Вставить("Конфигурация", Конфигурация);
		
		ТабДокумент = Отчет.СформироватьТабличныйДокумент("Ошибки", ПараметрыНастроек);
		ТабДокумент.Записать(ПутьДляОтчетов+"\index.html",ТипФайлаТабличногоДокумента.HTML5);
		
		СформироватьXML_CheckStyle(ПутьДляОтчетов+"\reports\check-style-report.xml","\src\"+EPF);
		ЗавершитьРаботуСистемы(Ложь,,"0");
	КонецЕсли;
КонецПроцедуры

Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",")
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

