Функция СобратьОшибки(Критичность)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НайденныеОшибки.Объект КАК Объект,
		|	НайденныеОшибки.Правило,
		|	НайденныеОшибки.МестоОбнаружения,
		|	НайденныеОшибки.Ошибка
		|ИЗ
		|	РегистрСведений.НайденныеОшибки КАК НайденныеОшибки
		|ГДЕ
		|	НайденныеОшибки.Объект.Владелец.Владелец = &Конфигурация
		|	И НайденныеОшибки.Объект.Владелец = &Версия
		|	И НайденныеОшибки.ПричинаОсобенности = ЗНАЧЕНИЕ(Справочник.ПричиныОсобенности.ПустаяСсылка)
		|	И НайденныеОшибки.Ошибка.Критичность = &Критичность
		|	И НайденныеОшибки.МестоОбнаружения ПОДОБНО ""%стр.%""
		|ИТОГИ ПО
		|	Объект";
	
	Запрос.УстановитьПараметр("Версия",			Версия);
	Запрос.УстановитьПараметр("Конфигурация",	Конфигурация);
	Запрос.УстановитьПараметр("Критичность",	Критичность);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;

КонецФункции

Функция СформироватьXMLОтчет(ПутьСохранения, ПутьКИсходникам) Экспорт
	ВыборкаОшибок = СобратьОшибки(Перечисления.УровниКритичностиОшибок.Совместимо);
	ВыборкаПоОбъектам = ВыборкаОшибок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ФайлОтчета=Новый ЗаписьXML();
	ФайлОтчета.ОткрытьФайл(ПутьСохранения,"utf8");
	ФайлОтчета.ЗаписатьОбъявлениеXML();
	ФайлОтчета.ЗаписатьНачалоЭлемента("checkstyle");
		ФайлОтчета.ЗаписатьАтрибут("version","1.3.0");
		Пока ВыборкаПоОбъектам.Следующий() Цикл
			Объект=ВыборкаПоОбъектам.Объект;
			Если Объект.ТипОбъекта=Перечисления.ТипыОбъектов.Обработка Тогда
				Путь=ПутьКИсходникам+"\ObjectModule.bsl";
			ИначеЕсли Объект.ТипОбъекта=Перечисления.ТипыОбъектов.Форма или Объект.ТипОбъекта=Перечисления.ТипыОбъектов.УправляемаяФорма Тогда
				Путь=ПутьКИсходникам+"\Form\"+Объект.Наименование+"\Module.bsl";
			Иначе //пока на остальное пофиг
				Продолжить;
			КонецЕсли;
			ФайлОтчета.ЗаписатьНачалоЭлемента("file");
				ФайлОтчета.ЗаписатьАтрибут("name",Путь);
			ФайлОтчета.ЗаписатьКонецЭлемента();
		КонецЦикла;
	ФайлОтчета.ЗаписатьКонецЭлемента();
	ФайлОтчета.Закрыть();
КонецФункции