Функция СобратьОшибки(Критичность)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НайденныеОшибки.Объект КАК Объект,
		|	НайденныеОшибки.Правило,
		|	НайденныеОшибки.МестоОбнаружения,
		|	НайденныеОшибки.Ошибка
		|ИЗ
		|	РегистрСведений.НайденныеОшибки КАК НайденныеОшибки
		|ГДЕ
		|	НайденныеОшибки.Объект.Владелец = &Версия
		|	И НайденныеОшибки.ПричинаОсобенности = ЗНАЧЕНИЕ(Справочник.ПричиныОсобенности.ПустаяСсылка)
		|	И НайденныеОшибки.Ошибка.Критичность = &Критичность
		|	И НайденныеОшибки.МестоОбнаружения ПОДОБНО ""%стр.%""
		|ИТОГИ ПО
		|	Объект";
	
	Запрос.УстановитьПараметр("Версия",			Версия);
	Запрос.УстановитьПараметр("Критичность",	Критичность);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;

КонецФункции

Функция СформироватьXML_CheckStyle(ПутьСохранения, ПутьКИсходникам) Экспорт
	ВыборкаОшибок		= СобратьОшибки(Перечисления.УровниКритичностиОшибок.Совместимо);
	ВыборкаПоОбъектам	= ВыборкаОшибок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВременныйФайлОтчета = ПолучитьИмяВременногоФайла("xml");
	ВременныйКаталог	= КаталогВременныхФайлов();
	ФайлОтчета=Новый ЗаписьXML;
	Файл = Новый Файл(ПутьСохранения);
	Каталог = Новый Файл(Файл.Путь);
	Если не Каталог.Существует() Тогда
		СоздатьКаталог(Файл.Путь);
	КонецЕсли;
	ФайлОтчета.ОткрытьФайл(ПутьСохранения,"utf8", Ложь);
	ФайлОтчета.ЗаписатьОбъявлениеXML();
	ФайлОтчета.ЗаписатьНачалоЭлемента("checkstyle");
		ФайлОтчета.ЗаписатьАтрибут("version","1.3.0");
		Пока ВыборкаПоОбъектам.Следующий() Цикл
			Объект=ВыборкаПоОбъектам.Объект;
			Если Объект.ТипОбъекта=Перечисления.ТипыОбъектов.Обработка Тогда
				Путь=ПутьКИсходникам+"\ObjectModule.bsl";
			ИначеЕсли Объект.ТипОбъекта=Перечисления.ТипыОбъектов.Форма или Объект.ТипОбъекта=Перечисления.ТипыОбъектов.УправляемаяФорма Тогда
				Путь=ПутьКИсходникам+"\Form\"+Объект.Наименование+"\Module.bsl";
			Иначе //пока на остальное пофиг
				Продолжить;
			КонецЕсли;
			ФайлОтчета.ЗаписатьНачалоЭлемента("file");
				ФайлОтчета.ЗаписатьАтрибут("name",Путь);
			ФайлОтчета.ЗаписатьКонецЭлемента();
		КонецЦикла;
	ФайлОтчета.ЗаписатьКонецЭлемента();
	ФайлОтчета.Закрыть();
	
	//А теперь чуть чуть магии
	УбитьВОМ(ВременныйФайлОтчета, ПутьСохранения, ВременныйКаталог);	
КонецФункции

Процедура УбитьВОМ(Знач ИсходныйФайл, РезультирующийФайл, ВременнаяПапка, МассивФайлов = Неопределено)
    Если МассивФайлов = Неопределено Тогда
        МассивФайлов = Новый Массив;
    КонецЕсли;
    бин = Новый ДвоичныеДанные(ИсходныйФайл);
    размер = бин.Размер();
    новыйРазмер = Макс(Окр(размер/2,0),3);
    массив = РазделитьФайл(ИсходныйФайл,новыйРазмер);
    Если массив.Количество() = 2 Тогда
        МассивФайлов.Вставить(0,массив[1]);
    КонецЕсли;
    Если новыйРазмер = 3 Тогда
        ОбъединитьФайлы(МассивФайлов,РезультирующийФайл);
        УдалитьФайлы(ВременнаяПапка);
    Иначе
        УбитьВОМ(массив[0],РезультирующийФайл,ВременнаяПапка,МассивФайлов);
    КонецЕсли;
КонецПроцедуры